app/controllers/emails_controller.rb

    def create
        from_user_email = email_params[:from_user]
        user_id = email_params[:user_id]
        to_user_email = User.find(user_id).email
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]