app/controllers/requests_controller.rb

    def index
        if  params[:user_id]
            userid = params[:user_id]
            @requests = Request.where(user_id: userid)
        else
            @requests = Request.all
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 10]]

    def create
        @request = Request.create!(request_params)
---
INSERT INTO "requests" ("title", "description", "lat", "lng", "address", "user_id", "created_at", "updated_at", "category", "user_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def destroy
        @requests = Request.find(params[:id])
        @requests.destroy
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 15]]